Revit 2026 API

# RebarUpdateCurvesDataAlignedFreeFormSetOrientationOptions Property

---

Orientation options for an Aligned Free Form Rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions { get; }
```
```vb
Public ReadOnly Property AlignedFreeFormSetOrientationOptions As AlignedFreeFormSetOrientationOptions
	Get
```
```cpp
public:
property AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions {
	AlignedFreeFormSetOrientationOptions get ();
}
```
```fsharp
member AlignedFreeFormSetOrientationOptions : AlignedFreeFormSetOrientationOptions with get
```

#### Property Value

AlignedFreeFormSetOrientationOptions

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace